errors = {
    0: {
        "color": "ffbe0b",
        "rgb": (250, 190, 11),
        "name": "прилегающие дефекты",
    },
    1: {
        "color": "fb5607",
        "rgb": (251, 86, 7),
        "name": "дефекты целостности",
    },
    2: {
        "color": "ff006e",
        "rgb": (255, 0, 110),
        "name": "дефекты геометрии",
    },
    3: {
        "color": "8338ec",
        "rgb": (131, 56, 236),
        "name": "дефекты постобработки",
    },
    4: {
        "color": "3a86ff",
        "rgb": (58, 134, 255),
        "name": "дефекты невыполнения",
    }
}